# -*- coding: utf-8 -*-
#+Title: 日本語・Japanisch
#+Author: Göran Kirchner
#+Language: de

#+Startup: showall
#+Options: toc:nil H:4 num:4 todo:nil pri:nil tags:nil ^:nil ':t \n:nil stat:nil tex:t
#+Property: header-args :cache yes
#+Exclude_Tags: noexport
#+BIND: org-latex-tables-centered nil
#+Setupfile: ./inc/theme-readtheorg.setup
#+INCLUDE: "./inc/preamble-handout.org"

#+BEGIN_SRC elisp :results silent :exports none
(defun my-org-export-change-options (plist backend)
  (cond 
    ((equal backend 'html)
     (plist-put plist :with-toc t)
     (plist-put plist :section-numbers nil))
    ((equal backend 'latex)
     (plist-put plist :with-toc t)
     (plist-put plist :section-numbers t)))
  plist)
(add-to-list 'org-export-filter-options-functions 'my-org-export-change-options)
(setq org-html-htmlize-output-type 'css)
(setq org-latex-tables-centered nil)
#+END_SRC

#+BEGIN_SRC latex :exports results
\ifxetex
  \newcommand{\textls}[2][5]{%
    \begingroup\addfontfeatures{LetterSpace=#1}#2\endgroup
  }
  \renewcommand{\allcapsspacing}[1]{\textls[15]{#1}}
  \renewcommand{\smallcapsspacing}[1]{\textls[10]{#1}}
  \renewcommand{\allcaps}[1]{\textls[15]{\MakeTextUppercase{#1}}}
  \renewcommand{\smallcaps}[1]{\smallcapsspacing{\scshape\MakeTextLowercase{#1}}}
  \renewcommand{\textsc}[1]{\smallcapsspacing{\textsmallcaps{#1}}}
\fi
#+END_SRC

#+Latex_Header: \usepackage{xeCJK}
# #+Latex: \setCJKmainfont[BoldFont=STHeiti,ItalicFont=STKaiti]{STSong}
#+Latex_Header: \setCJKmainfont{YuKyokasho} % for \rmfamily
#+Latex_Header: \setCJKsansfont{YuGothic} % for \sffamily
#+Latex_Header: \setCJKmonofont{Hiragino Maru Gothic ProN}
#+Latex_Header: \setCJKfamilyfont{cjk-vert}[Script=CJK,RawFeature=vertical]{YuKyokasho} % vertical font assignment
# #+Latex_header: \usepackage{CJKutf8}
#+Latex_Header: \usepackage{ruby}
#+Latex_Header: \renewcommand{\rubysep}{-0.2ex}
#+Latex_Header: \usepackage{booktabs}
#+Latex_Header: \usepackage[normalem]{ulem}
#+Latex_Header: \usepackage{soul}
** TODO All                                                        :noexport:

#+name: signs
- sun
- moon
- rain
- field

#+BEGIN_SRC emacs-lisp :var tables=signs :exports results :cache no
(mapcan (lambda (x) (org-babel-ref-resolve (first x))) tables)
#+END_SRC

#+RESULTS:
| 1 | sign    | 日                                            |
| 1 | imi     | sun                                           |
| 1 | onyomi  | ニチ・ジツ                                    |
| 1 | kunyomi | ひ・か                                        |
| 1 | strokes | 4                                             |
| 1 | mnemo   | ..                                            |
| 2 | sign    | 月                                            |
| 2 | imi     | moon                                          |
| 2 | onyomi  | ゲツ・ガツ                                    |
| 2 | kunyomi | つき                                          |
| 2 | strokes | 4                                             |
| 2 | mnemo   | ..                                            |
| 3 | sign    | 雨                                            |
| 3 | imi     | rain                                          |
| 3 | onyomi  | ウ                                            |
| 3 | kunyomi | あめ・あま                                    |
| 3 | strokes | 8                                             |
| 3 | mnemo   | Rain falls from a big cloud.                  |
| 4 | sign    | 田                                            |
| 4 | imi     | field                                         |
| 4 | onyomi  | デン                                          |
| 4 | kunyomi | た                                            |
| 4 | strokes | 5　                                           |
| 4 | mnemo   | The rice paddy is laid out to be grid-shaped. |

#+Latex: \newpage
